List chemicalSubstance = [
  {
    "name": "Хлор",
  },
  {
    "name": "Аміак",
  },
  {
    "name": "Соляна к-та",
  },
  {
    "name": "Сірчана к-та",
  },
  {
    "name": "Азотна к-та",
  },
  {
    "name": "Етилмеркаптан",
  },
  {
    "name": "Акролеїн",
  },
  {
    "name": "Миш'яковистий водень",
  },
  {
    "name": "Бензол",
  },
  {
    "name": "Фтороводень",
  },
  {
    "name": "Бромоводень",
  },
  {
    "name": "Водень цианістий",
  },
  {
    "name": "Диметиламін",
  },
  {
    "name": "Бромометан",
  },
  {
    "name": "Метил хлористий",
  },
  {
    "name": "Метилакрилат",
  },
  {
    "name": "Метилмеркаптан",
  },
  {
    "name": "Метил акрилової к-ти",
  },
  {
    "name": "Окисли азоту",
  },
  {
    "name": "Монооксид вуглецю",
  },
  {
    "name": "Оксид етилену",
  },
  {
    "name": "Сірчистий ангідрид",
  },
  {
    "name": "Сірководень",
  },
  {
    "name": "Сірковуглець",
  },
  {
    "name": "Формальдегід",
  },
  {
    "name": "Фтор",
  },
  {
    "name": "Трихлорид фосфору",
  },
  {
    "name": "Оксихлорид фосфору",
  },
  {
    "name": "Хлорціан",
  },
  {
    "name": "Фосген",
  },
  {
    "name": "Хлорпікрін",
  }
];

chemicalSubstances() {
  return chemicalSubstance;
}

Map<String, dynamic> chemical = {
  "Хлор": {
    "name": "Хлор",
    "coecificHeat": 0.876,
    "boilingPoint": -34.60,
    "vaporisation": 288.50,
    "density": 1557.00,
    "molWeight": 70.91,
    "toxiCosis": 36.00,
    "densityGas": 3.20,
    "nhr":
        "     Хлор (Cl). \n     Зеленувато- жовтий газ із різким задушливим запахом, важчий за повітря, малорозчинний у воді, корозійно активний. Клас небезпеки - 2. ГДК у робочій зоні - 1 мг/м-3. \n     ГДК у повітрі населеного пункту: разова - 0,1 мг/м-3; добова - 0,03 мг/м-3. \n     Перевезення: у контейнерах, залізничних цистернах, балонах у стисненому або зрідженому стані. Зберігання: у циліндричних (об’ємом 10-250 м-3) і кульових (об’ємом 600-2000 м-3) резервуарах під тиском власних парів 18 кгс/см-2. У разі виникнення розгерметизації відбувається різке викидання хлору в концентрації, що перевищує смертельну в кілька разів. Димить у разі викидання в атмосферу. \n     Під час випаровування 1 кг зрідженого хлору утворюється 315 л газоподібного. \n     Вибухо- та пожежонебезпека: негорючий. Ємності під час нагрівання можуть вибухати. Взаємодія з металами у разі зволоження призводить до утворення горючих газів. Підтримує горіння. Накопичується в низинах, тунелях, підвалах тощо"
  },
  "Аміак": {
    "name": "Аміак",
    "coecificHeat": 4.780,
    "boilingPoint": -33.40,
    "vaporisation": 1190.70,
    "density": 682.00,
    "molWeight": 17.03,
    "toxiCosis": 454.00,
    "densityGas": 0.80,
    "nhr":
        "     Амміак (NH₃). \n     Безбарвний газ із задушливим різким запахом, легший за повітря, розчинний у воді. Клас небезпеки - 4. ГДК у робочій зоні - 20 мг/м3. ГДК у повітрі населеного пункту: разова - 0,2 мг/м3; добова - 0,04 мг/м3. Перевезення та зберігання: у зрідженому стані під тиском власних парів 6-18 кгс/см2. \n     Може зберігатися в ізотермічних резервуарах за атмосферного тиску. Димить у разі викидання в атмосферу. Вибухо- та пожежонебезпека: горючий, горить за наявності постійного вогню. Під час нагрівання ємності вибухають. З повітрям утворює вибухо-небезпечні суміші. Накопичується в низинах, тунелях, підвалах тощо. \n     Дія на організм: При концентрації 40-80 мг/м2 пари аміаку викликають пошкодження органів дихання, різке роздратування очей, сверблячку та опіки шкіри. Смертельними вважаються концентрації 1500-2700 мг/м2 при експозиції 0,5-1год. Як захиститись від аміаку? \n     Відчувши запах аміаку, необхідно рухатись проти вітру. Оскільки аміак легший за повітря, слід спуститись в яму. Захист органів дихання від аміаку забезпечують промислові фільтруючі, ізолюючі протигази, газові респіратори і протигази марки «КД» або сучасні комбіновані. Коли концентрація аміаку невідома, роботи необхідно проводити в ізолюючих протигазах, для захисту шкіри використовуються захисні костюми, гумові чоботи та рукавиці. \n     При ураженні аміаком потерпілого треба: \n     - винести на свіже повітря, перевозити в лежачому положенні, забезпечити тепло і спокій, давати дихати зволоженим киснем; \n     - не робити штучне дихання;/n     - шкіру і очі промити водою протягом 15 хв. і 1% розчином борної кислоти."
  },
  "Соляна к-та": {
    "name": "Соляна к-та",
    "coecificHeat": 2.460,
    "boilingPoint": 61.00,
    "vaporisation": 300.00,
    "density": 1191.00,
    "molWeight": 36.50,
    "toxiCosis": 120.00,
    "densityGas": 1.64,
    "nhr":
        "     Соляна кислота (HCl). \n     У стані рідини - безбарвна рідина, легкорозчинна у воді, має корозійну дію на більшість металів. Клас небезпеки - 3. ГДК у робочій зоні - 5 мг/м3. ГДК у повітрі населеного пункту: разова - 0,2 мг/м3; добова - 0,2 мг/м3. \n     Перевезення: у металевих залізничних та автомобільних цистернах, контейнерах, балонах, покритих шаром гуми. Зберігання: у наземних циліндричних вертикальних резервуарах (об’ємом 50-5000 м3) покритих шаром гуми, за атмосферного тиску та температури навколишнього середовища або в скляних бутлях об’ємом 20 л. \n     Легко випаровується і димить у разі проливання. \n     Вибухо- та пожежонебезпека: негорюча. У разі взаємодії з металами виділяється вибухонебезпечний газ - водень"
  },
  "Сірчана к-та": {
    "name": "Сірчана к-та",
    "coecificHeat": 1.340,
    "boilingPoint": 279.00,
    "vaporisation": 612.00,
    "density": 1835.00,
    "molWeight": 98.08,
    "toxiCosis": 72.00,
    "densityGas": 0,
    "nhr":
        "     Сірчана кислота (H₂SO₄).  \n     Безбарвна масляниста, дуже в'язка і гігроскопічна рідина. Одна з найсильніших неорганічних кислот і є дуже їдкою та небезпечною.  Клас небезпеки - 2.ГДК у повітрі робочої зони - 1,0 мг/м3. Зберігання: в баках, розміщених в будівлі або під навісом. \n     Концентровану сірчану кислоту і олеум зберігають в сталевих нефутерованих баках. Сталеві баки для зберігання особливо чистої, а також низькоконцентрованої сірчаної кислоти футерують кислотостійкою керамікою. \n     Перевезення: технічну сірчану кислоту перевозять в залізничних сталевих цистернах вантажопідйомністю до 50 т. Відвантаження дрібних партій сірчаної кислоти допускається в контейнерах, бочках ємністю до 1 т і в скляних бутлях ємністю 30-45 л. Перевезення олеуму проводиться в спеціальних цистернах, забезпечених теплоізоляцією. Щоб запобігти можливості замерзання олеуму в цистернах під час його перевезення, перед наливанням в цистерни олеум підігрівають"
  },
  "Азотна к-та": {
    "name": "Азотна к-та",
    "coecificHeat": 3.100,
    "boilingPoint": 83.00,
    "vaporisation": 481.00,
    "density": 1513.00,
    "molWeight": 63.01,
    "toxiCosis": 144.00,
    "densityGas": 0,
    "nhr":
        "     Азотна кислота (HNO₃). \n     Безбарвна рідина (азотна червона та суміші для нітрування із вмістом NHO3 90% і вище – червоно-бурого кольору). Отруйна, ГДКр.з. - 5 мг/м3 . На повітрі “димить”. Добре розчиняється у воді. \n      При взаємодії з водою можливе сильне нагрівання, розбризкування і утворення токсичних газів. Важча за воду. Летка. Пари важчі за повітря, накопичуються в низьких ділянках земної поверхні, підвалах, тунелях. Сильний окисник. Корозійна для більшості металів. \n     Оксиди азоту, які утворюються в азотній кислоті під час нагрівання та взаємодії з металами, органічними речовинами тощо, мають специфічний запах, токсичні, подразнюють дихальні шляхи (поріг сприймання запаху 8 мг/м3 )"
  },
  "Етилмеркаптан": {
    "name": "Етилмеркаптан",
    "coecificHeat": 1.890,
    "boilingPoint": 35.00,
    "vaporisation": 431.00,
    "density": 839.00,
    "molWeight": 62.13,
    "toxiCosis": 132.00,
    "densityGas": 0,
    "nhr":
        "     Етилмеркаптан, етантіол (С₂Н₅SН). \n     Безбарвна легкозаймиста рідина з неприємним запахом гнилої капусти. Клас небезпеки - 2. ГДК у повітрі робочої зони - 1 мг/м3. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. \n     Зберігання: у наземних вертикальних циліндричних резервуарах з коефіцієнтом заповнення 0,9-0,95 за атмосферного тиску і температури навколишнього середовища. Максимальний об’єм зберігання - 1,6 т. \n     Вибухо- та пожежонебезпека: з повітрям утворюють вибухонебезпечні суміші. \n     Пари - важчі за повітря. Погано розчиняється у воді, добре - в спирті та ефірі. Небезпечний у разі вдихання, ковтання, потрапляння на шкіру"
  },
  "Акролеїн": {
    "name": "Акролеїн",
    "coecificHeat": 2.150,
    "boilingPoint": 52.70,
    "vaporisation": 542.20,
    "density": 839.00,
    "molWeight": 56.07,
    "toxiCosis": 12.00,
    "densityGas": 2.37,
    "nhr":
        "     Акролеїн (С₃Н₄О). \n     Безбарвна рідина, дуже летюча, з різким запахом, сльозоточива, має низьку температуру кипіння. Клас небезпеки - 2. ГДК у повітрі робочої зони - 0,2 мг/м-3. ГДК у повітрі населених пунктів - 0,03 мг/м-3. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. Зберігання: у наземних вертикальних циліндричних резервуарах (об’ємом 50-5000 м-3) з коефіцієнтом заповнення 0,9-0,95 за атмосферного тиску і температури навколишнього середовища. \nВибухо- та пожежонебезпека: утворюють з повітрям вибухонебезпечні суміші. Випари - важчі за повітря, накопичуються в низинах, підвалах, тунелях."
  },
  "Миш'яковистий водень": {
    "name": "Миш'яковистий водень",
    "coecificHeat": 0.494,
    "boilingPoint": -62.50,
    "vaporisation": 214.00,
    "density": 1640.00,
    "molWeight": 77.94,
    "toxiCosis": 12.00,
    "densityGas": 3.50,
    "nhr":
        "     Миш’яковистий водень (АsH₃). \n     Безбарвний газ, важчий за повітря, або рідина, важча за воду, у чистому вигляді без запаху, за наявності домішок діетиларсину пахне часником. Клас небезпеки - 2. ГДК у повітрі робочої зони - 0,1 мг/м-3. ГДК у ґрунті - 2 мг/м-3. \n     Перевезення: у зрідженому стані в контейнерах, залізничних цистернах, балонах, які є місцем його тимчасового зберігання. \n     Зберігання: зберігають у наземних горизонтальних циліндричних (об’ємом 10-250 м-3) резервуарах під тиском власних парів 6-18 кгс/см-2 або в наземних вертикальних циліндричних резервуарах (об’ємом 50-5000 м-3) за атмосферного тиску і температури навколишнього середовища. \n     Вибухо- та пожежонебезпека: у разі взаємодії з повітрям утворює вибухонебезпечні суміші, самозаймається на повітрі. У разі нагрівання вище 5000 °C розкладається на водень і миш’як. Має гостроспрямований механізм дії, що вимагає автоматичного контролю за вмістом речовини в повітрі."
  },
  "Бензол": {
    "name": "Бензол",
    "coecificHeat": 1.800,
    "boilingPoint": 80.00,
    "vaporisation": 396.00,
    "density": 883.00,
    "molWeight": 78.00,
    "toxiCosis": 3600.00,
    "densityGas": 3.50,
    "nhr":
        "     Бензол (C₆H₆). \n     Безбарвна летка рідина з характерним солодкуватим запахом. Рідини. Нерозчинний у воді. Легший за воду. Леткий. Пари важчі за повітря, накопичуються в низьких ділянках поверхні, підвалах, тунелях. Забруднюють водоймища. \n     Вибухо- та пожежонебезпечний. Горючий. Легко займистий від іскор і полум'я. Пари утворюють з повітрям вибухонебезпечні суміші. Ємкості можуть вибухати при нагріванні. У порожніх ємкостях із залишків утворюються вибухонебезпечні суміші. \n     Рідини мають температуру спалаху від -18 до +61° C. Над поверхнею розлитої рідини утворюється горюча концентрація парів при температурі навколишнього середовища, рівній температурі спалаху рідини і вище."
  },
  "Фтороводень": {
    "name": "Фтороводень",
    "coecificHeat": 2.490,
    "boilingPoint": 19.50,
    "vaporisation": 1560.00,
    "density": 980.00,
    "molWeight": 20.01,
    "toxiCosis": 240.00,
    "densityGas": 0.92,
    "nhr":
        "     Фтороводень (HF). \n     Безбарвний газ (рідина) з різким запахом. Клас небезпеки - 1. ГДК у повітрі робочої зони - 0,5 мг/м-3. ГДК у повітрі населених пунктів: середньодобова - 0,005 мг/м3, максимальна разова - 0,02 мг/м-3. \n     Перевезення: у залізничних і автомобільних цистернах, контейнерах, балонах, які можуть бути місцем тимчасового зберігання. Зберігання: у зрідженому стані за температури навколишнього середовища під тиском власних парів 6-18 кгс/см-2 у наземних циліндричних горизонтальних резервуарах. Максимальний об’єм зберігання - 1,98 т. \n     Вибухо- та пожежонебезпека: негорючий, вибухонебезпечний у разі нагрівання. Необмежено розчиняється у воді, утворюючи фтористоводневу (плавикову) кислоту з виділенням значної кількості тепла, інтенсивно реагує з багатьма силікатними матеріалами, у тому числі зі склом, кварцом, піском (двоокисом кремнію). На повітрі димить внаслідок утворення з парами води дрібних крапель розчину кислоти."
  },
  "Бромоводень": {
    "name": "Бромоводень",
    "coecificHeat": 0.740,
    "boilingPoint": -67.80,
    "vaporisation": 217.00,
    "density": 1490.00,
    "molWeight": 80.90,
    "toxiCosis": 144.00,
    "densityGas": 3.50,
    "nhr":
        "     Бромоводень (НВr). \n     Безбарвна негорюча рідина з різким запахом, важча за воду, розчинна у воді. Клас небезпеки - 3. ГДК у повітрі робочої зони - 2 мг/м-3. ГДК у повітрі населених пунктів - 1 мг/м-3. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які є місцем його тимчасового зберігання. Зберігання: у наземних вертикальних циліндричних резервуарах з коефіцієнтом заповнення 0,9-0,95 за атмосферного тиску і температури навколишнього середовища. Максимальний об’єм зберігання - 2,5 т. \n     Вибухо - та пожежонебезпека: корозійна для більшості металів, у взаємодії з металами займиста, випари накопичуються в низьких ділянках поверхні, підвалах, тунелях."
  },
  "Водень цианістий": {
    "name": "Водень цианістий",
    "coecificHeat": 2.620,
    "boilingPoint": 25.60,
    "vaporisation": 933.00,
    "density": 689.00,
    "molWeight": 27.00,
    "toxiCosis": 12.00,
    "densityGas": 0.90,
    "nhr":
        "     Синильна кислота (ціанистий водень) (НСN). \n     Безбарвна легколетюча легкозаймиста рухома рідина із запахом мигдалю, легша за воду. Клас небезпеки - 2. ГДК у повітрі робочої зони - 0,3 мг/м-3. ГДК у повітрі населених пунктів - 0,01 мг/м-3. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. Зберігання: у наземних вертикальних циліндричних резервуарах (об’ємом 50-5000 м-3) з коефіцієнтом заповнення 0,9-0,95 за атмосферного тиску і температури навколишнього середовища. Максимальний об’єм зберігання - 2 т. \n     Вибухо- та пожежонебезпека: легкозаймиста під час взаємодії з повітрям; утворює вибухонебезпечні суміші, які за силою вибуху перевершують тротил. Добре розчиняється у воді та в усіх органічних розчинниках (спиртах, ефірі, бензині та рідких вуглеводнях). \n     Легко вбирається різними матеріалами (гума, текстиль, цегла, бетон, харчові продукти). Випари - легші за повітря."
  },
  "Диметиламін": {
    "name": "Диметиламін",
    "coecificHeat": 3.000,
    "boilingPoint": 7.00,
    "vaporisation": 591.00,
    "density": 661.00,
    "molWeight": 45.00,
    "toxiCosis": 60.00,
    "densityGas": 1.95,
    "nhr":
        "     Диметиламін (CH₃)₂NH. \n     Безбарвний горючий газ із різким аміачним запахом. Клас небезпеки - 2. ГДК у повітрі робочої зони - 1 мг/м-3. ГДК у повітрі населених пунктів - 0,05 мг/м-3. ГДК у воді водоймищ - 0,1 мг/л. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. Зберігання: у зрідженому стані в горизонтальних циліндричних резервуарах об’ємом (10-250 м-3) з коефіцієнтом заповнення 0,8 за температури навколишнього середовища під тиском власних парів 6-18 кгс/см-2. Максимальний об’єм зберігання - 160 т. \n     Вибухо- та пожежонебезпека: утворює з повітрям вибухонебезпечні суміші. Важчий за повітря. Розчинний у воді. Під час виходу в атмосферу димить, накопичується в низинах, підвалах, тунелях. У разі зріджування утворює безбарвну летючу рідину з різким, дратівливим запахом, розчинну у воді, легшу за воду. Димить на повітрі з утворенням важчих за повітря парів."
  },
  "Бромометан": {
    "name": "Бромометан",
    "coecificHeat": 0.428,
    "boilingPoint": 4.00,
    "vaporisation": 253.00,
    "density": 1732.00,
    "molWeight": 94.94,
    "toxiCosis": 72.00,
    "densityGas": 0,
    "nhr":
        "     Бромометан (CH₃Br). \n     Безбарвний газ із характерним запахом, важчий за повітря в 3,3 раза. Клас небезпеки - 2. ГДК у повітрі робочої зони - 1 мг/м-3. \n     Перевезення: у залізничних і автомобільних цистернах, контейнерах, балонах, які можуть бути місцем тимчасового зберігання. \n     Зберігання: у горизонтальних циліндричних резервуарах (об’ємом 10-250 м-3) за температури навколишнього середовища під тиском власних парів 6-18 кгс/см-2. Максимальний об’єм зберігання - 10 т. Вибухо- та пожежонебезпека: з повітрям утворює вибухонебезпечні суміші. Розчинний у більшості органічних сполук, мало - у воді."
  },
  "Метил хлористий": {
    "name": "Метил хлористий",
    "coecificHeat": 1.607,
    "boilingPoint": -24.20,
    "vaporisation": 424.00,
    "density": 983.00,
    "molWeight": 50.49,
    "toxiCosis": 648.00,
    "densityGas": 2.30,
    "nhr":
        "     Хлорометан (CH₃Cl). \n     Безбарвний горючий газ із солодкуватим запахом. Клас небезпеки - 3. ГДК у повітрі робочої зони - 5 мг/м-3. ГДК у повітрі населених пунктів - 0,06 мг/м-3. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. Зберігання: у наземних горизонтальних циліндричних резервуарах (об’ємом 10-250 м-3) з коефіцієнтом заповнення 0,8 за температури навколишнього середовища під тиском власних парів 6-18 кгс/см-2. Максимальний об’єм зберігання - 50 т. \n     Вибухо- та пожежонебезпека: можливе займання на відстані. Реагує бурхливо з порошкоподібним алюмінієм, порошкоподібним цинком, трихлоридом алюмінію і етиленом із можливим займанням і вибухом. \n     Газ - важчий за повітря, може стелитися по землі, накопичуватися в приміщеннях з низькими стелями, викликаючи нестачу кисню. Агресивний щодо багатьох металів за наявності вологи. Речовина розкладається у разі спалювання з утворенням токсичних та їдких парів, у тому числі хлористого водню і фосгену."
  },
  "Метилакрилат": {
    "name": "Метилакрилат",
    "coecificHeat": 2.010,
    "boilingPoint": 80.20,
    "vaporisation": 384.50,
    "density": 953.00,
    "molWeight": 86.09,
    "toxiCosis": 360.00,
    "densityGas": 0,
    "nhr":
        "     Метилакрилат (С₄Н₆О₂). \n     Безбарвна малолетюча рідина. Клас небезпеки - 4. ГДК у повітрі робочої зони - 5 мг/м-3. ГДК у повітрі населених пунктів - 0,01 мг/м-3. ГДК у воді водоймищ - 0,02 мг/л. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. Зберігання: у наземних вертикальних циліндричних резервуарах (об’ємом 50-5000м-3) з коефіцієнтом заповнення 0,9-0,95 за атмосферного тиску і температури навколишнього середовища. Максимальний об’єм зберігання - 76 т. \n     Вибухо- та пожежонебезпека: легкозаймиста рідина з різким запахом, з повітрям утворює вибухонебезпечні суміші. Легша за воду, малорозчинна, пари важчі за повітря, накопичуються в низинах, підвалах, тунелях."
  },
  "Метилмеркаптан": {
    "name": "Метилмеркаптан",
    "coecificHeat": 1.850,
    "boilingPoint": 6.00,
    "vaporisation": 511.20,
    "density": 867.00,
    "molWeight": 48.10,
    "toxiCosis": 102.00,
    "densityGas": 0,
    "nhr":
        "     Метантіол (Метилмеркаптан). (CH₄S). \n     Безбарвний горючий газ із різким неприємним запахом. Клас небезпеки - 2. ГДК у повітрі робочої зони - 0,8 мг/м-3. ГДК у повітрі населених пунктів - 0,00001 мг/м-3. ГДК у воді водоймищ - 0,0002 мг/л. \n     Перевезення: у залізничних і автомобільних цистернах, контейнерах, балонах, які можуть бути місцем тимчасового зберігання. Зберігання: у зрідженому стані в наземних горизонтальних циліндричних резервуарах (об’ємом 10-250 м-3) за температури навколишнього середовища під тиском власних парів 6-18 кгс/см-2. Вибухо- та пожежонебезпека: можливе займання на відстані. З повітрям утворює вибухонебезпечні суміші. \n     Речовина розкладається у разі розігрівання і спалювання з утворенням токсичних оксидів сірки. Реагує з кислотами з утворенням вогненебезпечного токсичного газу (сірководень). Погано розчиняється у воді, добре - в спирті й ефірі."
  },
  "Метил акрилової к-ти": {
    "name": "Метил акрилової к-ти",
    "coecificHeat": 2.030,
    "boilingPoint": 77.30,
    "vaporisation": 575.00,
    "density": 813.00,
    "molWeight": 53.06,
    "toxiCosis": 45.00,
    "densityGas": 2.24,
    "nhr":
        "     Акрилонітрил (С₃Н₃N). \n     Безбарвна летюча легкозаймиста рідина з неприємним запахом. Клас небезпеки - 2. ГДК у повітрі робочої зони - 0,5 мг/м-3. ГДК у повітрі населених пунктів - 0,03 мг/м-3. ГДК у воді водоймищ - 0,2 мг/л. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. \n     Зберігання: у наземних вертикальних циліндричних резервуарах (об’ємом 50-5000 м-3) з коефіцієнтом заповнення 0,9-0,95 за атмосферного тиску і температури навколишнього середовища. Максимальний об’єм зберігання - 1000 т. \n     Вибухо- та пожежонебезпека: утворюють з повітрям вибухонебезпечні суміші, пари - в 1,9 раза важчі за повітря. Розчиняється у воді і багатьох органічних розчинниках. У разі з’єднання з водою утворює амід акрилової кислоти, у разі повного гідролізу дає акрилову кислоту."
  },
  "Окисли азоту": {
    "name": "Окисли азоту",
    "coecificHeat": 0.817,
    "boilingPoint": 21.00,
    "vaporisation": 272.00,
    "density": 1490.00,
    "molWeight": 46.01,
    "toxiCosis": 90.00,
    "densityGas": 0,
    "nhr":
        "     Оксид азоту (NxOy або NO або NO₂). \n     Безбарвний газ, блідо-жовта рідина. Клас небезпеки - 3. ГДК оксиду (діоксиду) у повітрі робочої зони - 5,0 (2,0) мг/м-3. ГДК оксиду (діоксиду) у повітрі населених пунктів - 0,085 (0,6) мг/м-3. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. \n     Зберігання: у вертикальних циліндричних (об’ємом 50-5000 м-3) або горизонтальних циліндричних (об’ємом 5-100 м-3) резервуарах за атмосферного тиску і температури навколишнього середовища. \n     Вибухо- та пожежонебезпека: є сильним окислювачем, органічні суміші загоряються, суміші з метаном, бутаном вибухають. Пари - важчі за повітря, мають бурий колір і задушливий запах. З водою утворює азотну кислоту. Має гостроспрямований механізм дії, що вимагає автоматичного контролю за вмістом речовини в повітрі."
  },
  "Монооксид вуглецю": {
    "name": "Монооксид вуглецю",
    "coecificHeat": 2.190,
    "boilingPoint": -191.50,
    "vaporisation": 216.50,
    "density": 1000.00,
    "molWeight": 28.01,
    "toxiCosis": 1620.00,
    "densityGas": 0.97,
    "nhr":
        "     Чадний газ, окис вуглецю (СО) \n     - монооксид вуглецю (міжнародна назва – карбон монооксид) – безбарвний газ, що не має запаху, тому він особливо небезпечний, бо його не можна відчути. Клас небезпечності – 4.  \n     Він легший за повітря і тому піднімається в гору. Норми гранично допустимих концентрацій (ГДК) шкідливих речовин розроблені для різних груп населення. Для повітря населених місць середньодобова норма становить 3,0 мг/м3; в атмосферному повітрі максимальна разова гранично допустима концентрація – 5,0 мг/м3 (при 20-30-хвилинному впливі). \n     У повітрі робочої зони допустима наявність 20,0 мг/м3, тобто приблизно 0,002% СО (протягом усього робочого дня).  На відкритому просторі небезпека мінімальна. Інертний за звичайних умов, при високих температурах він згорає у кисні синім полум’ям. Зріджується дуже погано, а в рідкому стані має густину меншу за 1 і є вибухонебезпечний. Майже не розчиняється у воді, а з повітрям може утворювати вибухові суміші. Окис вуглецю, чадний газ (СО). Безбарвний, дуже отруйний газ без запаху. У воді майже не розчиняється і не вступає з нею в хімічну взаємодію."
  },
  "Оксид етилену": {
    "name": "Оксид етилену",
    "coecificHeat": 1.096,
    "boilingPoint": 10.70,
    "vaporisation": 554.20,
    "density": 887.00,
    "molWeight": 44.05,
    "toxiCosis": 3600.00,
    "densityGas": 1.70,
    "nhr":
        "     Оксид етилену (С₂Н₄О). \n     Безбарвний газ із солодкуватим запахом, що нагадує ефір. Клас небезпеки - 2. ГДК у повітрі робочої зони - 1,0 мг/м-3. ГДК у повітрі населених пунктів (середньодобова) - 0,3 мг/м-3. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. Зберігання: у сферичних резервуарах (об’ємом 600-2000 м-3) за температури навколишнього середовища під тиском власних парів 6-18 кгс/см-2. Максимальний об’єм зберігання - 583 т. \n     Вибухо- та пожежонебезпека: з повітрям утворює вибухонебезпечну суміш. Добре розчиняється у воді, спирті та інших органічних розчинниках. Важчий за повітря. Зріджується в безбарвну рухливу рідину з пекучим смаком, може полімеризуватися під час нагрівання під впливом кислот, основ, хлоридів і оксидів металів з можливим загорянням або вибухом. Розкладається у разі розігрівання вище 500 °C, внаслідок чого виникає небезпека пожежі та вибуху. Реагує бурхливо з багатьма сполуками. Срібло, мідь, ртуть або магній можуть реагувати з домішками до газу з утворенням вибухових сполук."
  },
  "Сірчистий ангідрид": {
    "name": "Сірчистий ангідрид",
    "coecificHeat": 1.450,
    "boilingPoint": -10.10,
    "vaporisation": 361.30,
    "density": 1462.00,
    "molWeight": 64.07,
    "toxiCosis": 194.00,
    "densityGas": 2.90,
    "nhr":
        "     Сірчистий ангідрид, діоксид сірки (SO₂). \n     Безбарвний газ із різким характерним запахом, важчий за повітря, розчинний у воді. Клас небезпеки - 3. ГДК у робочій зоні -10 мг/м-3. ГДК у повітрі населеного пункту: разова - 0,5 мг/м-3; добова - 0,05 мг/м-3. \n     Перевезення: у залізничних та автомобільних цистернах, контейнерах і балонах. \n     Зберігання: у горизонтальних циліндричних резервуарах (об’ємом 10-250 м-3) за температури навколишнього середовища під тиском власних парів 6-18 кгс/см-2. Зріджений сірчистий ангідрид зберігають у сферичних газгольдерах за температури навколишнього середовища та тиску 0,7-30 кгс/см-2. Димить у разі викидання в атмосферу. Розчиняється у воді з утворенням сірчистої кислоти. \n     Вибухо- та пожежонебезпека: негорючий. У разі нагрівання ємності вибухають. Накопичується в низинах, тунелях, підвалах тощо."
  },
  "Сірководень": {
    "name": "Сірководень",
    "coecificHeat": 2.010,
    "boilingPoint": -60.40,
    "vaporisation": 310.00,
    "density": 964.00,
    "molWeight": 34.10,
    "toxiCosis": 966.00,
    "densityGas": 1.50,
    "nhr":
        "     Сірководень (H₂S). \n     Безбарвний газ із різким неприємним запахом тухлих яєць, важчий за повітря, розчинний у воді. Клас небезпеки - 2. ГДК у робочій зоні - 10 мг/м-3. ГДК у повітрі населеного пункту: разова - 0,008 мг/м-3; добова - 0,008 мг/м-3. \n     Перевезення: у залізничних та автомобільних цистернах, контейнерах і балонах. \n     Зберігання: у сферичних газгольдерах (об’ємом 300-2000 м-3) за температури навколишнього середовища та тиску 0,7-30 кгс/см-2. \n     Вибухо- та пожежонебезпека: горючий. З повітрям утворює вибухонебезпечні суміші. Під час нагрівання ємності вибухають. Накопичується в низинах, тунелях, підвалах тощо."
  },
  "Сірковуглець": {
    "name": "Сірковуглець",
    "coecificHeat": 0.991,
    "boilingPoint": 46.20,
    "vaporisation": 377.80,
    "density": 1263.00,
    "molWeight": 76.14,
    "toxiCosis": 2592.00,
    "densityGas": 6.00,
    "nhr":
        "     Сірковуглець (CS₂). \n     Безбарвна рідина з ефірним запахом, пари - важчі за воду, нерозчинна у воді. Клас небезпеки - 2. ГДК у робочій зоні - 1 мг/м-3. ГДК у повітрі населеного пункту: разова - 0,03 мг/м-3; добова - 0,005 мг/м-3. \n     Перевезення: у залізничних та автомобільних цистернах, контейнерах і балонах. \n     Зберігання: у вертикальних циліндричних (об’ємом 50-5000 м-3) або горизонтальних циліндричних (об’ємом 5-100 м-3) резервуарах за атмосферного тиску та температури навколишнього середовища. \n     Вибухо- та пожежонебезпека: легкозаймиста рідина, легко займається від іскор, полум’я та під час нагрівання. Може вибухати внаслідок самозаймання. Займається після гасіння пожежі. Пари утворюють з повітрям вибухонебезпечні суміші, які можуть поширюватися далеко від місця витоку. Існує небезпека вибуху парів у повітрі та в приміщенні. Накопичується в низинах, тунелях, підвалах тощо."
  },
  "Формальдегід": {
    "name": "Формальдегід",
    "coecificHeat": 2.340,
    "boilingPoint": -19.30,
    "vaporisation": 273.00,
    "density": 815.00,
    "molWeight": 30.00,
    "toxiCosis": 36.00,
    "densityGas": 1.03,
    "nhr":
        "     Формальдегід, формалін (СН₂О). \n     Безбарвний газ, розчинний у воді, пари - важчі за повітря. Клас небезпеки - 2. ГДК у робочій зоні - 0,5 мг/м-3. ГДК у повітрі населеного пункту: разова - 0,035 мг/м-3; добова - 0,003 мг/м-3. ГДК у повітрі населеного пункту: разова - 0,2 мг/м-3; добова - 0,04 мг/м-3. \n     Перевезення: у залізничних та автомобільних цистернах, контейнерах і балонах. \n     Зберігання: у горизонтальних циліндричних резервуарах (об’ємом 10-250 м-3) за температури навколишнього середовища під тиском власних парів 6-18 кгс/см-2. Максимальний об’єм зберігання - 220 т. \n     Вибухо- та пожежонебезпека: горючий, легко займається від відкритого вогню. У суміші з повітрям та за високої температури здатен до самозаймання. Накопичується в низинах, тунелях, підвалах тощо."
  },
  "Фтор": {
    "name": "Фтор",
    "coecificHeat": 1.510,
    "boilingPoint": -188.00,
    "vaporisation": 727.00,
    "density": 1512.00,
    "molWeight": 38.00,
    "toxiCosis": 12.00,
    "densityGas": 1.70,
    "nhr":
        "     Фтор (F). \n     Газ блідо-жовтого кольору з різким характерним запахом, схожим на суміш запахів хлору та озону. Клас небезпеки - 2. ГДК у повітрі робочої зони - 0,15 мг/м-3. ГДК у воді водоймищ - 1,5 мг/л. ГДК у ґрунті - 2,8 мг/кг. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. \n     Зберігання: у зрідженому стані в наземних горизонтальних циліндричних (об’ємом 10-250 м-3) і кульових резервуарах (об’ємом 600-2000 м-3) під тиском власних парів 18 кгс/см-2. \n     Вибухо- та пожежонебезпека: вибухонебезпечний, сильний окислювач, викликає горіння. Реагує з водою, утворюючи плавикову кислоту, з органічними речовинами реагує бурхливо (можливе займання). Важчий за повітря."
  },
  "Трихлорид фосфору": {
    "name": "Трихлорид фосфору",
    "coecificHeat": 1.000,
    "boilingPoint": 76.00,
    "vaporisation": 100.00,
    "density": 1574.00,
    "molWeight": 137.33,
    "toxiCosis": 180.00,
    "densityGas": 0,
    "nhr":
        "     Трихлорид фосфору (РСI₃). \n     Безбарвна негорюча рідина, важча за воду. Клас небезпеки - 2. ГДК у повітрі робочої зони - 0,2 мг/м-3. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. \n     Зберігання: у наземних вертикальних циліндричних резервуарах (об’ємом 50-5000 м-3) з коефіцієнтом заповнення 0,9-0,95 за атмосферного тиску і температури навколишнього середовища. Максимальний об’єм зберігання - 100 т. \n     Вибухо- та пожежонебезпека: негорючий. Димить на повітрі, пари - важчі за повітря. Речовина розкладається під час розігрівання з утворенням токсичних та їдких парів, у тому числі хлористого водню і оксидів фосфору. Реагує з окислювачами. Реагує бурхливо з водою з виділенням тепла і продуктів розкладання, включаючи соляну і фосфорну кислоти, зумовлюючи можливе займання і вибух. Реагує бурхливо зі спиртами, фенолами."
  },
  "Оксихлорид фосфору": {
    "name": "Оксихлорид фосфору",
    "coecificHeat": 1.000,
    "boilingPoint": 105.80,
    "vaporisation": 100.00,
    "density": 1645.00,
    "molWeight": 153.33,
    "toxiCosis": 3.60,
    "densityGas": 0,
    "nhr":
        "     Оксихлорид фосфору (POCl₃). \n     Безбарвна високолетюча негорюча рідина. Клас небезпеки - 1. ГДК у повітрі робочої зони - 0,05 мг/м-3. ГДК у воді водоймищ - 1,5 мг/л. ГДК у ґрунті - 2,8 мг/кг. \n     Перевезення: у контейнерах, балонах, які можуть бути місцем тимчасового зберігання. Зберігання: у балонах (об’ємом 0,005-0,08 м-3) за атмосферного тиску і температури навколишнього середовища. \n     Вибухо- та пожежонебезпека: реагує бурхливо з водою з виділенням тепла і продуктів розкладання, а саме соляної і фосфорної кислот, зумовлюючи можливе займання і вибух. Пари - важчі за повітря. Речовина розкладається у разі розігрівання з утворенням токсичних та їдких парів, у тому числі хлористого водню і оксидів фосфору. Реагує бурхливо зі спиртами, фенолами, амінами. Небезпечне забруднення повітря досягається дуже швидко під час випаровування за температури 20 °C."
  },
  "Хлорціан": {
    "name": "Хлорціан",
    "coecificHeat": 1.490,
    "boilingPoint": 12.60,
    "vaporisation": 208.00,
    "density": 1258.00,
    "molWeight": 61.50,
    "toxiCosis": 45.00,
    "densityGas": 2.52,
    "nhr":
        "     Хлорціан (ClСN). \n     Безбарвний горючий газ із різким задушливим запахом. Клас небезпеки - 2. ГДК у повітрі робочої зони - 0,5 мг/м-3. ГДК у воді водоймищ - 0,07 мг/л. ГДК у повітрі населених пунктів: середньодобова - 0,001 мг/м3, максимальна разова - 0,003 мг/м-3. \n     Перевезення: у контейнерах, залізничних цистернах, балонах, які можуть бути місцем тимчасового зберігання. \n     Зберігання: у наземних горизонтальних циліндричних резервуарах (об’ємом 10-250 м-3) під тиском власних парів 18 кгс/см-2 або в наземних вертикальних циліндричних резервуарах (об’ємом 50-5000 м-3) за атмосферного тиску та температури навколишнього середовища. \n     Вибухо- та пожежонебезпека: реагує бурхливо з водою з виділенням тепла і продуктів розкладання, включаючи соляну і фосфорну кислоти, зумовлюючи можливе займання і вибух. Пари - важчі за повітря в 2,1 раза."
  },
  "Фосген": {
    "name": "Фосген",
    "coecificHeat": 1.020,
    "boilingPoint": 8.20,
    "vaporisation": 158.00,
    "density": 1420.00,
    "molWeight": 98.90,
    "toxiCosis": 33.00,
    "densityGas": 3.48,
    "nhr":
        "     Фосген (COCl₂). /n     Безбарвний газ із характерним солодкуватим запахом гнилих фруктів, прілого листя і мокрого сіна. Клас небезпеки - 2. ГДК у повітрі робочої зони - 0,5 мг/м-3. \n     Перевезення: у контейнерах, залізничних і автомобільних цистернах, балонах, які можуть бути місцем тимчасового зберігання. \n     Зберігання: у зрідженому стані за температури навколишнього середовища під тиском власних парів 6-18 кгс/см-2 у наземних циліндричних горизонтальних резервуарах. Максимальний об’єм зберігання - 52 т. \n     Вибухо- та пожежонебезпека: негорючий. Під час викиду (виливу) дуже швидко досягається небезпечна концентрація цього газу в повітрі. У газоподібному стані в 3,5 рази важчий за повітря, в рідкому - в 1,4 рази важчий за воду. Погано розчиняється у воді, легко - в органічних розчинниках бензині, толуолі, ксилолі, оцтовій кислоті тощо."
  },
  "Хлорпікрін": {
    "name": "Хлорпікрін",
    "coecificHeat": 1.360,
    "boilingPoint": 112.30,
    "vaporisation": 359.00,
    "density": 1658.00,
    "molWeight": 164.38,
    "toxiCosis": 1.20,
    "densityGas": 0,
    "nhr":
        "     Хлорпікрін (CCl₃NO₂). \n     Блідо-жовта масляниста рідина з різким запахом, важча за воду, має низьку температуру кипіння, погано розчиняється у воді. Клас небезпеки - 2. ГДК у робочій зоні - 0,7 мг/м-3. ГДК у повітрі населеного пункту: разова - 0,007 мг/м-3; добова - 0,007 мг/м-3. \n     Перевезення: в контейнерах, залізничних цистернах, балонах. \n     Зберігання: у вертикальних циліндричних (об’ємом 50-5000 м-3) або горизонтальних циліндричних (об’ємом 5-100 м-3) резервуарах за атмосферного тиску та температури навколишнього середовища. Максимальний об’єм зберігання - 5 т. \n     Вибухо- та пожежонебезпека: під час нагрівання до температури 400-500 °C утворюється фосген. Легко випаровується навіть взимку, утворюючи летальну концентрацію. Влітку стійкість хлорпікріну мала, на відкритій місцевості вимірюється кількома хвилинами, але в низинах, у лісі летальна концентрація утримується декілька годин."
  }
};

Map<String, dynamic> funChemical() {
  return chemical;
}

Map<String, dynamic> verticalStability = {
  "Ізотермія": {"name": "ізотермія", "param": 0.0},
  "Конвекція": {"name": "конвекція", "param": -0.15},
  "Інверсія": {"name": "інверсія", "param": 0.15}
};

Map<String, dynamic> probability = {
  "Довгострокове": {"name": "Довгострокове", "param": 0.9},
  "Аварійне": {"name": "Аварійне", "param": 0.5},
  "Часткова наявність даних": {
    "name": "Часткова наявність даних",
    "param": 0.75
  }
};

Map<String, dynamic> phisical = {
  "Рідкий": {"name": "рідкий", "param": 1},
  "Газоподібний": {"name": "газоподібний", "param": 0}
};
